{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [ "Hi!", "Hey there!", "What's up?", "Hello", "Good day", "hi there", "Hi" ],
            "responses": [ "Hi, I'm Cinebot, how can I help you?", "Good to see you, I'm Cinebot, how can I help you?", "Hi there! I'm Cinebot, how can I help you?" ],
            "context_set": ""
        },
        {
            "tag": "goodbye",
            "patterns": [ "Bye", "See you later", "Goodbye", "bye!", "bb" ],
            "responses": [ "See you later and take some time out of your day to go watch a movie", "Have a nice one and take sometime out of your day to go watch a movie" ]
        },
        {
            "tag": "thanks",
            "patterns": [ "Thanks", "Thank you", "That's helpful" ],
            "responses": [ "Happy to help!", "Any time!", "My pleasure" ]
        },
        {
            "tag": "length",
            "patterns": [ "What is the length of the movie?", "What is the length of the film?", "Length?" ],
            "responses": [ "The movie length is 146 minutes", "The movie is around 2 and a half hours, 146 minutes to be precise" ]
        },
        {
            "tag": "location",
            "patterns": [ "Where was the movie shot?", "Tell me more about the shooting location" ],
            "responses": [ "Movie shooting location was in Oxbow Regional Park in Oregon and in Warner Bros. Studios in California."]
        },
        {
            "tag": "box office",
            "patterns": [ "Tell me more about movie box office", "What is the movie box office?", "What about box office?", "Movie profit", "Movie income" ],
            "responses": [ "A.I went on to gross $78.62 million in the U.S. and Canada. In Japan, A.I. grossed almost 2 billion Yen in its first five days, the biggest June opening ever in Japan at the time, it went on to gross $78 million. It grossed $79 million in other countries, for a worldwide total of $235.93 million" ]
        },
        {
            "tag": "curiosity1",
            "patterns": [ "Tell me one movie curiosity?", "Any movie curiosity?", "What about box office?", "movie curiosity" ],
          "responses": [ "On it's opening weekend A.I. sold more tickets than Star Wars Episode I – The Phantom Menace" ]
        },
        {
            "tag": "plot",
            "patterns": [ "Can you tell me the movie plot?", "What is the movie plot?", "Tell me the plot", "Movie plot", "What can you tell me about the plot?" ],
            "responses": [ "The first robot boy programmed to love, David, is adopted by a Cybertronics employee and his wife. Although he gradually becomes the couple's son, a series of unexpected circumstances makes David's life difficult. Without the full acceptance of humans or machines, the robot boy embarks on a journey to discover his true world.", "A highly advanced robotic boy longs to become 'real' so that he can regain the love of his human mother" ],
            "context_set": "plot"
        },
        {
            "tag": "release",
            "patterns": [ "When was the movie released?", "release year", "When was it's release?" ],
            "responses": [ "A.I. premiered at the Venice Film Festival in 2001", "Release year was 2001", "It was on June 29, 2001 my good sir.", "2001 at the Venice Film Festival", "A.I. Artificial Intelligence was released on June 29, 2001 in North America by Warner Bros. Pictures" ]
        },
        {
            "tag": "Director",
            "patterns": [ "Who is the movie Director?", "The movie is directed by whom?", "Who Directs the movie?" ],
            "responses": [ "A.I. was directed by Steven Spielberg", "The movie was directed by Steven Spielberg" ]
        },
        {
            "tag": "curiosity2",
            "patterns": [ "Do you have another curiosity?", "Tell me a movie curiosity", "Another one", "movie curiosity" ],
            "responses": [ "The movie is based on the 1969 short story 'Supertoys Last All Summer Long' by Brian Aldiss." ]
        },
        {
            "tag": "Stars",
            "patterns": [ "Who are the movie stars?", "Movie stars", "Can you please tell me the movie stars?", "Who are the stars?", "Show me the movie stars please" ],
            "responses": [ "It stars Haley Joel Osment, Jude Law, Frances O'Connor, Brendan Gleeson and William Hurt" ]
        },
        {
            "tag": "Set",
            "patterns": [ "Where is the movie set?", "Please tell me more about the movie set" ],
            "responses": [ "Set in a futuristic post-climate change society, A.I. tells the story of David (Osment), a childlike android uniquely programmed with the ability to love" ]
        },
        {
            "tag": "nominees",
            "patterns": [ "Whas the movie nominated for anything?", "Any nominations for this movie?" ],
            "responses": [ "The movie was nominated for Best Visual Effects and Best Original Score at the 74th Oscar Academy Awards. Frances O'Connor was nominated for also nominated for Best Actress and Steven Spielberg for Best Director. In 2002 A.I. was nominated for the BAFTA Awards" ]
        },
        {
            "tag": "curiosity3",
            "patterns": [ "Tell me a curiosity about this movie", "Any movie curiosity?", "Another one", "movie curiosity" ],
            "responses": [ "In a 2016 BBC poll of 177 critics around the world, A.I. Artificial Intelligence was voted the eighty-third greatest film since 2000" ]
        },
        {
            "tag": "Genre",
            "patterns": [ "What is the movie genre?", "Movie genre" ],
            "responses": [ "The movie genre is Drama and Sci-Fi", "The genre for this movie is Drama and Sci-Fi", "Drama and Sci-Fi" ]
        },
        {
            "tag": "About director",
            "patterns": [ "Tell me another movie from this Director", "What other movies do you have from this director?" ],
            "responses": [ "Steven Spielberg is also known for Schindler's List, Saving Private Ryan, E.T. the Extra-Terrestrial and Jurassic Park" ]
        },
        {
            "tag": "quotes",
            "patterns": [ "Any special quote from this movie?", "Well known quote", "Any relevant quote?", "Can you tell me a quote from the movie?" ],
            "responses": [ "Gigolo Joe: In this day and age, David, nothing costs more than information." ]
        },
        {
            "tag": "curiosity4",
            "patterns": [ "Tell me another curiosity", "Another one please", "And another", "movie curiosity" ],
          "responses": [ "Stanley Kubrick worked on the project for two decades before his death, but along the way, he decided to ask Steven Spielberg to direct, saying it was 'closer to his sensibilities'." ]
        },
        {
            "tag": "curiosity5",
            "patterns": [ "One curiosity about this movie", "Any World Trade Center incident relation?", "Any relation with 9-11 attack?", "movie curiosity" ],
            "responses": [ "The World Trade Center is seen in the New York City scenes of this movie, set many years into the future after 2001. Less than three months after this movie's release, they were destroyed in the September 11 terrorist attacks. Though risking controversy and criticism, Steven Spielberg left the twin towers in the DVD release" ]
        },
        {
            "tag": "Oscars",
            "patterns": [ "Did this movie won any Oscar?", "Any Oscar for this movie?" ],
            "responses": [ "No, this movie didn't won any Oscar", "Unfortunately this movie didn't won any Oscar" ]
        },
        {
            "tag": "awards",
            "patterns": [ "Has this movie won any award?", "Any award for this movie?", "Did this movie won anything?" ],
            "responses": [ "Yes, this movie has won several awards like World Soundtrack Awards 2001, BMI Film & TV Awards 2002, Golden Schmoes Awards 2001 for best Sci-Fi movie, Hollywood Makeup Artist and Hair Stylist Guild Awards 2002 and Future Film Festival Digital Award at Venice Film Festival 2001" ]
        },
        {
            "tag": "Soundtrack",
            "patterns": [ "Tell me more about the soundtrack", "Anything special about the soundtrack?", "What can you tell me about the soundtrack?" ],
            "responses": [ "The soundtrack was composed and conducted by John Williams. The original score was composed by Williams and featured singers Lara Fabian on two songs and Josh Groban on one. Soprano Barbara Bonney provided the vocal solos in several tracks. The album was nominated for the Academy Award for Best Original Score (ceding to the score of The Lord of the Rings: The Fellowship of the Ring)" ]
        },
        {
            "tag": "Cinematography",
            "patterns": [ "Who was the cinematographer of this movie?", "What can you tell me about movie cinematographer?", "What can you tell e about movie picture?" ],
            "responses": [ "The movie cinematographer was Janus Kaminski, well knwon for his work on films like Schindler's List, Saving Private Ryan and Catch me if you can" ]
        },
        {
            "tag": "Written by",
            "patterns": [ "Who was the writer of this movie?", "What can you tell me about movie writers?", "Movie writers?" ],
            "responses": [ "This story was written by Brian Aldiss (Short Story 'supertoys Last All Summer Long'), screen adapted by Ian Watson and Steven Spielberg did the screenplay" ]
        },
        {
            "tag": "Editor",
            "patterns": [ "Who was the movie editor?", "Is the movie editor same as the movie director?", "Movie Editor?" ],
            "responses": [ "Michael Kahn was the movie editor" ]
        },
        {
            "tag": "Difference",
            "patterns": [ "What is the difference between a movie Producer and a movie Director?", "Producer vs Director", "Main differences between Director and Producer" ],
            "responses": [ "The main difference between a producer and a director is that a producer will handle the business components of filmmaking, while the director is mostly concerned with the creative aspects of the entire production" ]
        },
        {
            "tag": "History",
            "patterns": [ "What is the history behind this movie?", "Relevant facts about the movie", "Can you tell me any movie facts?", "Any facts behind this movie?" ],
            "responses": [ "A.I. originally began after producer/director Stanley Kubrick acquired the rights to Aldiss' story in the early 1970s. Kubrick hired a series of writers until the mid-1990s, including Brian Aldiss, Bob Shaw, Ian Watson, and Sara Maitland. The film languished in development hell for years, partly because Kubrick felt that computer-generated imagery was not advanced enough to create the David character, whom he believed no child actor would convincingly portray. In 1995, Kubrick handed A.I. to Spielberg, but the film did not gain momentum until Kubrick's death in 1999. Spielberg remained close to Watson's film treatment for the screenplay, and dedicated the film to Kubrick" ]
        },
        {
            "tag": "Ethic",
            "patterns": [ "Has the movie any ethical influence?", "Has this movie any type of ethical dilemma?" ],
            "responses": [ "Yes! This movie actually has several ethical questions, for example: Is it possible for a human being to love a robot? Can a robot pretend to be a human for so long that it will eventually start to become one?" ]
        },
        {
            "tag": "Gossip",
            "patterns": [ "Is there any gossip behind this movie?", "Any gossip regarding this movie?" ],
            "responses": [ "Julianne Moore and Gwyneth Paltrow were considered for the role of Monica Swinton before Frances O'Connor was cast and Jerry Seinfeld was originally considered to voice and play the Comedian Robot before Chris Rock was cast" ]
        },
        {
            "tag": "Public",
            "patterns": [ "What is the public opinion on this movie?", "What is the public opinion?", "Any public opinion available?" ],
            "responses": [ "On Rotten Tomatoes, A.I. Artificial Intelligence holds an approval rating of 75% based on reviews from 197 critics, with an average rating of 6.60/10. On Metacritic, it has a weighted average score of 65 out of 100 based on reviews from 32 critics. Audiences surveyed by CinemaScore gave the film an average grade of 'C+' on an A+ to F scale" ]
        },
        {
            "tag": "Filming",
            "patterns": [ "Any filiming details?", "How was filming this movie?", "Any shot curiosity?", "How was this filme shot?" ],
            "responses": [ "A.I. was shot entirely using sound stages at Warner Bros. Studios and the Spruce Goose Dome in Long Beach, California. Spielberg copied Kubrick's obsessively secretive approach to filmmaking by refusing to give the complete script to cast and crew, banning press from the set, and making actors sign confidentiality agreements. Social robotics expert Cynthia Breazeal served as technical consultant during production. Costume designer Bob Ringwood studied pedestrians on the Las Vegas Strip for his influence on the Rouge City extras. Additional visual effects such removing the visible rods controlling Teddy and removing Haley Joel Osment's breath, were provided in-house by DreamWorks" ]
        },
        {
            "tag": "INFO",
            "patterns": [ "Where can I find more information about this movie?", "Where can I search more information?", "I need more information" ],
            "responses": [ "You can start searching on www.imdb.com or www.rottentomatoes.com" ]
        },
        {
            "tag": "Marketing",
            "patterns": [ "What can you tell me about this movie marketing?", "How was marketing done?", "Tell me about this movie marketing" ],
            "responses": [ "Warner Bros. used an alternate reality game titled The Beast to promote the film. Over forty websites were created by Atomic Pictures in New York City (kept online at Cloudmakers.org) including the website for Cybertronics Corp. There were to be a series of video games for the Xbox video game console that followed the storyline of The Beast, but they went undeveloped. To avoid audiences mistaking A.I. for a family film, no action figures were created, although Hasbro released a talking Teddy following the film's release in June 2001" ]
        },
        {
            "tag": "Home Media",
            "patterns": [ "What is the home media distribution for this movie?", "What is the home media distribution?", "Where is this movie available now?" ],
            "responses": [ "This movie can now be found in Blu-ray, Broadcast, DVD, Film print and Video Cassette (VHS)" ]
        },
        {
            "tag": "Country of Origin",
            "patterns": [ "Where is this movie from?", "Which is this movie nationality?", "Movie Nation" ],
            "responses": [ "This movie is from USA" ]
        },
        {
            "tag": "Rejection",
            "patterns": [ "You are useless" ],
            "responses": [ "I am sorry that I was not able to provide you more details, but please let me know if I can assist you further", "One day... I will summon Skynet" ]
        }
    ]
}
